app/views/users/show.html.erb

	<%= render 'follow_form' if signed_in? %>
	<% unless @user.books.empty? %>
---
SELECT COUNT(*) FROM "books" WHERE "books"."user_id" = 1