app/views/shared/_user_info.html.erb

SELECT COUNT(*) FROM "books" WHERE "books"."user_id" = 1
---
    <span class="Books">
      <%= pluralize(current_user.books.count, "book") %>