app/controllers/books_controller.rb

    def create
      @book  = current_user.books.build(params[:book])
          if @book.save
---
INSERT INTO "books" ("authors", "created_at", "isbn", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["authors", "helo"], ["created_at", Sun, 22 Jan 2012 01:22:50 UTC +00:00], ["isbn", 3], ["title", "new book"], ["updated_at", Sun, 22 Jan 2012 01:22:50 UTC +00:00], ["user_id", 1]]