app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "books".* FROM "books" WHERE "books"."user_id" = 1 ORDER BY books.created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "books" WHERE "books"."user_id" = 1
---
  def show
     @user = User.find(params[:id])
     @books = @user.books.paginate(:page => params[:page])

INSERT INTO "users" ("admin", "city", "country", "created_at", "email", "encrypted_password", "name", "salt", "state", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(params[:user])
    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "users" SET "city" = 'boston', "updated_at" = '2012-01-25 17:24:29.280059' WHERE "users"."id" = 3
---
  def update
        @user = User.find(params[:id])
        if @user.update_attributes(params[:user])